weilincao/RTOS_Grad_Lab_DMA_SD_Driver_And_Filesys/inc/esp8266PortD.c
//------------------- ESP8266InitUART-------------------
// - intializes uart and gpio needed to communicate with esp8266
// Configure UART2 for 115200bps operation
// Inputs: none
// Outputs: none
void ESP8266_InitUART(uint32_t baud, int echo){ volatile int delay;
  ESP8266_EchoResponse = echo;
  SYSCTL_RCGCUART_R |= 0x04; // Enable UART2
  while((SYSCTL_PRUART_R&0x04)==0){};
  SYSCTL_RCGCGPIO_R |= 0x0A; // Enable PORT B,D clock gating
  while((SYSCTL_PRGPIO_R&0x08)==0){}; 
  GPIO_PORTD_LOCK_R = 0x4C4F434B;   // 2) unlock GPIO Port D
  GPIO_PORTD_CR_R = 0xFF;           // allow changes to PD7
  GPIO_PORTD_AFSEL_R |= 0xC0; // PD7,PD6 UART2
  GPIO_PORTD_PCTL_R =(GPIO_PORTD_PCTL_R&0x00FFFFFF)|0x11000000;
  GPIO_PORTD_DEN_R   |= 0xC0; //PD6,PD7 UART2 
  UART2_CTL_R &= ~UART_CTL_UARTEN;                  // Clear UART2 enable bit during config
  UART2_IBRD_R = (80000000/16)/baud;   
  UART2_FBRD_R = ((64*((80000000/16)%baud))+baud/2)/baud;      
//  UART2_IBRD_R = 43;   // IBRD = int(80,000,000 / (16 * 115,200)) = int(43.403)
// UART2_FBRD_R = 26;   // FBRD = round(0.4028 * 64 ) = 26
  UART2_LCRH_R = (UART_LCRH_WLEN_8|UART_LCRH_FEN);  // 8 bit word length, 1 stop, no parity, FIFOs enabled
  UART2_IFLS_R &= ~0x3F;                            // Clear TX and RX interrupt FIFO level fields
  UART2_IFLS_R += UART_IFLS_RX1_8 ;                 // RX FIFO interrupt threshold >= 1/8th full
  UART2_IM_R  |= UART_IM_RXIM | UART_IM_RTIM;       // Enable interupt on RX and RX transmission end
  UART2_CTL_R |= UART_CTL_UARTEN;                   // Set UART2 enable bit    
  GPIO_PORTB_DIR_R |= 0x02; // PB1 output to reset
  GPIO_PORTB_PCTL_R =GPIO_PORTB_PCTL_R&0xFFFFFF0F;
  GPIO_PORTB_DEN_R   |= 0x02; //PB1 output 
  GPIO_PORTB_DATA_R |= 0x02;  // reset high
}
// -----------UART2_Handler-----------
// called on one receiver data input followed by timeout
// or     on going from 1 to 2 data input characters
void UART2_Handler(void){
  if(UART2_RIS_R & UART_RIS_RXRIS){   // rx fifo >= 1/8 full
    UART2_ICR_R = UART_ICR_RXIC;      // acknowledge interrupt
    ESP8266FIFOtoBuffer();
  }
  if(UART2_RIS_R & UART_RIS_RTRIS){   // receiver timed out
    UART2_ICR_R = UART_ICR_RTIC;      // acknowledge receiver time
    ESP8266FIFOtoBuffer();
  }
}
//--------ESP8266_EnableRXInterrupt--------
// - enables uart2 rx interrupt
// Inputs: none
// Outputs: none
void ESP8266_EnableRXInterrupt(void){
  NVIC_EN1_R = 1<<1; // interrupt 33
}

//--------ESP8266_DisableRXInterrupt--------
// - disables uart2 rx interrupt
// Inputs: none
// Outputs: none
void ESP8266_DisableRXInterrupt(void){
  NVIC_DIS1_R = 1<<1; // interrupt 33    
}

//--------ESP8266_PrintChar--------
// - prints a character to the esp8226 via uart
// Inputs: character to transmit
// Outputs: none
void ESP8266_PrintChar(char input){
  while((UART2_FR_R&UART_FR_TXFF) != 0) {};
  UART2_DR_R = input;
//  UART_OutChar(input); // echo debugging
}
//----------ESP8266FIFOtoBuffer----------
// - copies uart fifo to RXBuffer, using a circular MACQ to store the last data
// - NOTE: would probably be better to use a software defined FIFO here
// - LastReturnIndex is index to previous \n
// Inputs: none
// Outputs:none
void ESP8266FIFOtoBuffer(void){
  char letter;
  while((UART2_FR_R&UART_FR_RXFE) == 0){
    letter = UART2_DR_R;        // retrieve char from FIFO
    if(ESP8266_EchoResponse){
      UART_OutCharNonBlock(letter); // echo
    }
    if(RXBufferIndex >= BUFFER_SIZE){
      RXBufferIndex = 0; // store last BUFFER_SIZE received
    }
    RXBuffer[RXBufferIndex] = letter; // put char into buffer
    RXBufferIndex++; // increment buffer index 
    SearchCheck(letter);               // check for end of command
    ServerResponseSearchCheck(letter); // check for server response
    if(letter == '\n'){
      LastReturnIndex = CurrentReturnIndex;
      CurrentReturnIndex = RXBufferIndex;
    }    
  }
}

//---------ESP8266SendCommand-----
// - sends a string to the esp8266 module
// uses busy-wait
// however, hardware has 16 character hardware FIFO
// Inputs: string to send (null-terminated)
// Outputs: none
void ESP8266SendCommand(const char* inputString){
  int index = 0;
  while(inputString[index] != 0){
    ESP8266_PrintChar(inputString[index++]);
  }
}

// DelayMs
//  - busy wait n milliseconds
// Input: time to wait in msec
// Outputs: none
void DelayMs(uint32_t n){
  volatile uint32_t time;
  while(n){
    time = 6665;  // 1msec, tuned at 80 MHz
    while(time){
      time--;
    }
    n--;
  }
}
void DelayMsSearching(uint32_t n){
  volatile uint32_t time;
  while(n){
    time = 4065;  // 1msec, tuned at 80 MHz
    while(time){
      time--;
      if(SearchFound) return;
    }
    n--;
  }
}

/*
=======================================================================
==========          ESP8266 PUBLIC FUNCTIONS                 ==========
=======================================================================
*/
//-------------------ESP8266_Init --------------
// initializes the module as a client
// Inputs: baud rate: tested with 9600 and 115200
// Outputs: none
void ESP8266_Init(uint32_t baud){
  ESP8266_InitUART(baud,true); // baud rate, no echo to UART0
  ESP8266_EnableRXInterrupt();
  SearchLooking = false;
  SearchFound = false;
  ServerResponseSearchLooking = 0; // not looking for "+IPD"
  ServerResponseSearchFinished = 0;
  EnableInterrupts();
// step 1: AT+RST reset module
  printf("ESP8266 Initialization:\n\r");
  ESP8266_EchoResponse = true; // debugging
  if(ESP8266_Reset()==0){ 
    printf("Reset failure, could not reset\n\r"); while(1){};
  }
//  ESP8266SendCommand("AT+UART_CUR=115200,8,1,0,0\r\n");
//  UART_InChar();

//  ESP8266_InitUART(115200,true);
  
// step 2: AT+CWMODE=1 set wifi mode to client (not an access point)
  if(ESP8266_SetWifiMode(ESP8266_WIFI_MODE_CLIENT)==0){ 
    printf("SetWifiMode, could not set mode\n\r"); while(1){};
  }
// step 3: AT+CWJAP="ValvanoAP","12345678"  connect to access point 
  if(ESP8266_JoinAccessPoint(SSID_NAME,PASSKEY)==0){ 
    printf("JoinAccessPoint error, could not join AP\n\r"); while(1){};
  }
// optional step: AT+CIFSR check to see our IP address
  if(ESP8266_GetIPAddress()==0){ // data streamed to UART0, OK
    printf("GetIPAddress error, could not get IP address\n\r"); while(1){};
  } 
//// optional step: AT+CIPMUX==0 set mode to single socket 
//  if(ESP8266_SetConnectionMux(0)==0){ // single socket
//    printf("SetConnectionMux error, could not set connection mux\n\r"); while(1){};
//  } 
// optional step: AT+CWLAP check to see other AP in area
  if(ESP8266_ListAccessPoints()==0){ 
    printf("ListAccessPoints, could not list access points\n\r"); while(1){};
  }
// step 4: AT+CIPMODE=0 set mode to not data mode
  if(ESP8266_SetDataTransmissionMode(0)==0){ 
    printf("SetDataTransmissionMode, could not make connection\n\r"); while(1){};
  }
  ESP8266_InputProcessingEnabled = false; // not a server
}

//----------ESP8266_Reset------------
// resets the esp8266 module
// input:  none
// output: 1 if success, 0 if fail
int ESP8266_Reset(){int try=MAXTRY;
  SearchStart("ready"); //AT+GMR version 0018000902
//  SearchStart("ok");
  while(try){
    GPIO_PORTB_DATA_R &= ~0x02; // reset low
    DelayMs(10);
    GPIO_PORTB_DATA_R |= 0x02; // reset high
    ESP8266SendCommand("AT+RST\r\n");
    DelayMsSearching(500);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

